# Tutorial 09: 
# Categorical Encoding: Label & One Hot Encoding

## Apa itu Categorical Encoding
Categorical Encoding adalah **proses konversi nilai categorical menjadi nilai numerical.** Terdapat banyak jenis Categorical Encoding, antara lain: 
- **Label Encoding**
- **One Hot Encoding**

### 1. Label Encoding
Pada Label Encoding, setiap **kategori** pada suatu feature **akan diurutkan secara alfabet dan direpresentasikan dengan sebuah nilai integer**. 
#### - Dataset

In [6]:
import pandas as pd 

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'], 
    'age'    : [44, 34, 36, 35, 23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   36   98000
3      US   35   45000
4   Japan   23   34000

#### - Label Encoding pada Scikit Learn

In [11]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country']) # Merubah string menjadi numerik pada value-value di key Country. Dimana urutan numerik didasari pada urutan alfabet.
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   36   98000
3        2   35   45000
4        1   23   34000

### One Hot Encoding
Pada One Hot Encoding, setiap **kategori pada suatu feature akan diurutkan secara alfabet dan direpresentasikan sebagai kumpulan bits**. 
#### **-Dataset**

In [12]:
import pandas as pd 

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'], 
    'age'    : [44, 34, 36, 35, 23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   36   98000
3      US   35   45000
4   Japan   23   34000